app/controllers/topics_controller.rb

  def upvote
    @topic = Topic.find(params[:id])
    @topic.votes.create
---
SELECT  "topics".* FROM "topics"  WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "votes" ("created_at", "topic_id", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-05-03 21:56:32.098488"], ["topic_id", 1], ["updated_at", "2014-05-03 21:56:32.098488"]]

  def downvote
    @topic = Topic.find(params[:id])
    @topic.votes.first.destroy
---
SELECT  "topics".* FROM "topics"  WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 7]]
SELECT  "votes".* FROM "votes"  WHERE "votes"."topic_id" = ?  ORDER BY "votes"."id" ASC LIMIT 1  [["topic_id", 1]]

  def create
    @topic = Topic.new(topic_params)

    respond_to do |format|
      if @topic.save
---
INSERT INTO "topics" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-05-03 18:22:19.282811"], ["description", "all about type, fonts, and formatting"], ["title", "typography"], ["updated_at", "2014-05-03 18:22:19.282811"]]

  def update
    respond_to do |format|
      if @topic.update(topic_params)
---
UPDATE "topics" SET "description" = ?, "updated_at" = ? WHERE "topics"."id" = 2  [["description", "color background, mixing, combinations and other technical topics"], ["updated_at", "2014-05-03 18:26:36.780184"]]